Библиотека/src/Catalogs/Авторы/Авторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Авторы</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>77</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Библиотека/src/Catalogs/Авторы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Фамилия<>"" 
		ИЛИ Имя<>""
		ИЛИ Отчество<>"" Тогда		
		ПолноеНаименование 		= СокрП(Фамилия + " " + Имя + " " + Отчество);
	КонецЕсли;
	Если Фамилия<>"" 
		И Имя<>""
		И Отчество<>"" Тогда
		Наименование 	= Фамилия + " " + Сред(Имя,1,1) + ". " + Сред(Отчество,1,1) + ".";		
	ИначеЕсли Фамилия<>"" 
		И Имя<>"" Тогда
		Наименование 	= Фамилия + " " + Сред(Имя,1,1) + ".";
	ИначеЕсли Фамилия<>"" Тогда
		Наименование 	= Фамилия;
	ИначеЕсли Имя<>"" Тогда
		Наименование 	= Имя;
	КонецЕсли;
КонецПроцедуры
